[SAMPLE CODE]
# Pandasの基本操作

このサンプルコードでは、PandasのDataFrameを使って、次のことができます
- データ構造関連
- データ要素関連
- データ操作関連（クエリ）
- データ操作関連（クロス集計）
- データ操作関連（転置）
- データ操作関連（一意性と重複データ）

In [1]:
import pandas as pd
import numpy as np

/Users/hiroyasu.komaki/.pyenv/versions/3.7.4/lib/python3.7/site-packages/pandas/compat/__init__.py:117: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

#### 環境PATH

In [2]:
csv_path = './csv/'

fname = 'titanic_train'
fname2 = 'titanic_name'

#### データ読み込み（CSVファイルをDataFrameへ格納）

In [3]:
df = pd.read_csv(csv_path + fname +'.csv')
df.shape

(891, 12)

## データ構造関連

#### 全体像（行数・列数など）を表示

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### 行数・列数

In [5]:
df.shape

(891, 12)

In [6]:
# 行数
len(df)

891

#### データ項目（列・Column）

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### データ型（Dtype）

In [8]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## データ要素関連

#### 全体像（最大値・最小値・平均値など）を表示

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### 先頭行

In [10]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 末尾行

In [11]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

#### 要素の数

In [12]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [13]:
len(df.nunique())

12

#### 要素の種類と数

In [14]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [15]:
len(df['Embarked'].value_counts())

3

## 欠損値（Null・NaN）関連

#### 欠損データ項目

In [16]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### 欠損データの表示

In [17]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

#### 欠損データの補完（列指定で固定値を設定）

In [18]:
df_nan1 = df.fillna({'Embarked':'X'})

In [19]:
df_nan1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

#### 欠損データの補完（列指定で数式を設定）

In [20]:
df_nan2 = df.fillna({'Age': df['Age'].mean()})

In [21]:
df_nan2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### 欠損データの削除（欠損値を含む行を削除）

In [22]:
df_nan3 = df.dropna(subset = ['Age', 'Cabin'])

In [23]:
df_nan3.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [24]:
print('削除前：'+str(len(df)))
print('削除後：'+str(len(df_nan3)))

削除前：891
削除後：185

## データ操作関連（クエリ）

#### 指定した列を抽出（射影・projection）

In [25]:
df_qry1 = df[['PassengerId','Survived','Sex']]

In [26]:
df_qry1.head()

   PassengerId  Survived     Sex
0            1         0    male
1            2         1  female
2            3         1  female
3            4         1  female
4            5         0    male

#### 行の抽出（選択・selection）

In [27]:
df_qry2 = df[(df['Survived']==1) & (df['Sex']=='male')]

In [28]:
df_qry2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S

#### 複数の表を結合（結合・join）

In [29]:
df2 = pd.read_csv(csv_path + fname2 +'.csv')
df2.columns

Index(['Variable', 'Key', 'Value'], dtype='object')

In [30]:
df_qry3 = pd.merge(df, df2, left_on = ['Embarked'], right_on = ['Key'], how='left')

In [31]:
df_qry3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Variable,Key,Value
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,embarked,S,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,embarked,C,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,embarked,S,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,embarked,S,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,embarked,S,Southampton

#### 不要な列を削除

In [32]:
df_qry4 = df_qry3.drop(['Variable','Key'], axis=1)

In [33]:
df_qry4.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Value
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Southampton

## データ操作関連（クロス集計）

#### 件数

In [34]:
df_pvt1 = pd.crosstab(index = df['Sex'], columns = df['Pclass'])

In [35]:
df_pvt1.head()

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

#### 比率（全体）

In [36]:
df_pvt2 = pd.crosstab(index = df['Sex'], columns = df['Pclass'], normalize=True)

In [37]:
df_pvt2.head()

Pclass         1         2         3
Sex
female  0.105499  0.085297  0.161616
male    0.136925  0.121212  0.389450

#### 比率（行単位）

In [38]:
df_pvt3 = pd.crosstab(index = df['Sex'], columns = df['Pclass'], normalize='index')

In [39]:
df_pvt3.head()

Pclass         1         2         3
Sex
female  0.299363  0.242038  0.458599
male    0.211438  0.187175  0.601386

#### 合計

In [40]:
df_pvt4 = pd.crosstab(index = df['Sex'], columns = df['Pclass'], 
                      values=df['Fare'], aggfunc='sum',
                      margins=True, margins_name='Total')

In [41]:
df_pvt4.head()

Pclass           1          2          3       Total
Sex
female   9975.8250  1669.7292  2321.1086  13966.6628
male     8201.5875  2132.1125  4393.5865  14727.2865
Total   18177.4125  3801.8417  6714.6951  28693.9493

#### 合計比率

In [42]:
df_pvt5 = pd.crosstab(index = df['Sex'], columns = df['Pclass'], 
                      values=df['Fare'], aggfunc='sum', 
                      normalize=True)

In [43]:
df_pvt5.head()

Pclass         1         2         3
Sex
female  0.347663  0.058191  0.080892
male    0.285830  0.074305  0.153119

## データ操作関連（転置・Transpose）

In [44]:
df_tp = df.transpose()
# または↓
# df_tp = df.T

In [45]:
df_tp.head()

,0,1,2,3,4,5,6,7,8,9,...,881,882,883,884,885,886,887,888,889,890
PassengerId,1,2,3,4,5,6,7,8,9,10,...,882,883,884,885,886,887,888,889,890,891
Survived,0,1,1,1,0,0,0,0,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,1,3,3,1,3,3,2,...,3,3,2,3,3,2,1,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Sex,male,female,female,female,male,male,male,male,female,female,...,male,female,male,male,female,male,female,female,male,male

## データ操作関連（一意性と重複データ）

In [46]:
# データ重複
df.duplicated().value_counts()

False    891
dtype: int64

In [47]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [48]:
# ユニークチェック
unique_keys=[['PassengerId'],
             ['Pclass', 
              'Sex', 
              'Age', 
              'SibSp',
              'Parch', 
              'Ticket', 
              'Fare', 
              'Cabin', 
              'Embarked']]

In [49]:
# IDによる一意性
df.duplicated(subset=unique_keys[0]).value_counts()

False    891
dtype: int64

In [50]:
# 属性による一意性
df.duplicated(subset=unique_keys[1]).value_counts()

False    875
True      16
dtype: int64

In [51]:
# 一意でない場合、重複データを確認
df[df.duplicated(subset=unique_keys[1], keep='last')].reset_index(drop=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
1,75,1,3,"Bing, Mr. Lee",male,32.00,0,0,1601,56.4958,NaN,S
2,160,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,CA. 2343,69.5500,NaN,S
3,181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.5500,NaN,S
4,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.5500,NaN,S
5,230,0,3,"Lefebre, Miss. Mathilde",female,NaN,3,1,4133,25.4667,NaN,S
6,242,1,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,NaN,Q
7,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S
8,325,0,3,"Sage, Mr. George John Jr",male,NaN,8,2,CA. 2343,69.5500,NaN,S
9,370,1,1,"Aubart, Mme. Leontine Pauline",female,24.00,0,0,PC 17477,69.3000,B35,C
10,410,0,3,"Lefebre, Miss. Ida",female,NaN,3,1,4133,25.4667,NaN,S
11,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0000,NaN,S
12,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
13,644,1,3,"Foo, Mr. Choong",male,NaN,0,0,1601,56.4958,NaN,S
14,693,1,3,"Lam, Mr. Ali",male,NaN,0,0,1601,56.4958,NaN,S
15,793,0,3,"Sage, Miss. Stella Anna",female,NaN,8,2,CA. 2343,69.5500,NaN,S

In [52]:
# 一意でない場合、重複データを削除
len(df.drop_duplicates(subset=unique_keys[1], keep='last'))
# df.drop_duplicates(subset=unique_keys[1], keep='last', inplace=True)

875